package ch_arrays;

import java.util.Scanner;

public class Array02 {
    /* 1humans 배열에 이름을 입력할 수 있도록 할겁니다
    실행 예
    몇 명의 학생을 등록하시겠습니까 >>>5
    1 번 학생의 이름을 등록하세요 >>> 김일
    2 번 학생의 이름을 등록하세요 >>> 김이
    3 번 학생의 이름을 등록하세요 >>> 김삼
    4 번 학생의 이름을 등록하세요 >>> 김사
    5 번 학생의 이름을 등록하세요 >>> 김오

     scores 배영레 점수를ㄹ 입력할 수 있도록 하겁니다
     1 번 학생의 점수를 입력하세요 >>> 4.5
     2 번 학생의 점수를 입력하세요 >>> 4.4
     3 번 학생의 점수를 입력하세요 >>> 4.3
     4 번 학생의 점수를 입력하세요 >>> 4.2
     5 번 학생의 점수를 입력하세요 >>> 4.1

     학생들의 점수 총합은 21.5점입니다.
     */
    Scanner scanner = new Scanner(System.in);
    int[] arr1 = { 1, 2, 3, 4, 5 };


}
