package ch_arrays;

      import org.w3c.dom.ls.LSOutput;

/*
       #1 배열의 필요성
       여태까지의 수업을 기준으로 했을 때 10개의 정수형 데이터를
       저장하려면 int 변수를10 개 선언해서 저장해야 합니다 배열은 같은 자료형의 데이ㅣ터를 하나의변수에
       저장해서 관리하는 방식입니다. java에서 입니다
       #2 선언 방식
       자료형 [] 변수명
       형식 :
       java
       자료형 [] 변수명 = 데이터;
       int[] arr01 = {1.2.3.4.5}; // 배열의 선언 및 초기화
       //이상의 코드를 실행해봤을 때 배열 내부의 값을 확인할 수 없습니다
       @를 고려했을 떄 주소지만 추력됩니다

       현재 배열 내부에 다수의 데이터가 있기 때문에 콘솔창에서 전체확인이
       불가능합니다
       즉 element를 확인하기 위해서는 배열 내부로 직접 탐색하는 과정이 필요합니다
       이때 필요한 개념이 index(주소지라고도 할겁니다) 입니다.

       /for문을 통해서 arr01에 있는 내부 요소를 콘솔에 출력하시오
       /글런데 실행 예
       1 2 3 4 5
       로 추력하시오



 */
        public class Array01 {


 }
